<?php

namespace App\Support;

final class AmoPipelines
{
    public const DATA = [
        'PIPELINES_ORDER' => [
            9088966, // 1. «Квалификация v.1»
            9089018, // 2. «Заказы v.1»
        ],
        'TRACKED_PIPELINES_STATUSES' => [
            // 1. Квалификация v.1
            9088966 => [
                73140342 => 732013, // 1 Взяли в работу
                142 => 731999, // 1 Квалифицирован
                143 => 732011 // 1 Закрыто и не реализовано
            ],

            // 2. Заказы v.1
            9089018 => [
                73140050 => 731999, // 2 Квалифицирован
                73249794 => 731997, // 2 КП отправлено
                73140058 => 732001, // 2 Данные исполнителю отправлены
                73143094 => 732003, // 2 24 час до реализации
                73143098 => 732005, // 2 Начали реализацию
                73143102 => 732007, // 2 Закончили реализацию
                142      => 732009, // 2 Успешно реализовано
                143      => 732011, // 2 Закрыто и не реализовано
            ]
        ],
        'STATUSES_LABELS' => [
            9088966 => [
                73140342 => "1 Взяли в работу",
                142      => "1 Квалифицирован",
                143      => "1 Закрыто и не реализовано"
            ],

            9089018 => [
                73140050 => "2 Квалифицирован",
                73249794 => "2 КП отправлено",
                73140058 => "2 Данные исполнителю отправлены",
                73143094 => "2 24 час до реализации",
                73143098 => "2 Начали реализацию",
                73143102 => "2 Закончили реализацию",
                142      => "2 Успешно реализовано",
                143      => "2 Закрыто и не реализовано"
            ]
        ],
        'PIPELINES_LABELS' => [
            9088966 => 'Квалификация v.1',
            9089018 => 'Заказы v.1'
        ]
    ];
}