<?php

namespace App\Support;

final class AmoPipelines
{
    public const DATA = [
        'PIPELINES_ORDER' => [
            9088966, // 1. «Квалификация v.1»
            9089018, // 2. «Заказы v.1»
        ],
        'TRACKED_PIPELINES_STATUSES' => [
            // 1. Квалификация v.1
            9088966 => [
                73140342 => 732013, // Взяли в работу
                142 => 731999
            ],

            // 2. Заказы v.1
            9089018 => [
                73140050 => 731999, // Квалифицирован
                73249794 => 731997, // КП отправлено
                73140058 => 732001, // Данные исполнителю отправлены
                73143094 => 732003, // 24 час до реализации
                73143098 => 732005, // Начали реализацию
                73143102 => 732007, // Закончили реализацию
                142      => 732009, // Успешно реализовано
                143      => 732011, // Закрыто и не реализовано
            ]
        ],
        'STATUSES_LABELS' => [
            9088966 => [
                73140342 => "Взяли в работу"
            ],

            9089018 => [
                73140050 => "Квалифицирован",
                73249794 => "КП отправлено",
                73140058 => "Данные исполнителю отправлены",
                73143094 => "24 час до реализации",
                73143098 => "Начали реализацию",
                73143102 => "Закончили реализацию",
                142      => "Успешно реализовано",
                143      => "акрыто и не реализовано"
            ]
        ],
        'PIPELINES_LABELS' => [
            9088966 => 'Квалификация v.1',
            9089018 => 'Заказы v.1'
        ]
    ];
}