<?php

namespace App\Support;

final class AmoUsers{
    public const DATA = [
        'USERS' => [
            8038798,
            8047285,
            8047297,
            12674562,
            13545438,
            13970306
        ],
        'USERS_LABELS' => [
            8038798 => "Администратор",
            8047285 => "Алексей Лукинский",
            8047297 => "Дмитрий Верховцев",
            12674562 => "Пушкина Ксения",
            13545438 => "Лагунов Антон",
            13970306 => "Алёна Алексеева"
        ]
    ];
}